; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_4 ?v3 - type_3 ?v1 - type_1)
 	      (pred_3 ?v2 - object ?v1 - type_1)
	      (pred_1 ?v3 - type_3 ?v5 - type_2)
	      (pred_2 ?v3 - type_3 ?v2 - object ?v5 - type_2))

   (:action op_1
       :parameters  (?v3 - type_3 ?v8 ?v6 - type_1)
       :precondition (and  (pred_4 ?v3 ?v8))
       :effect (and  (pred_4 ?v3 ?v6)
		     (not (pred_4 ?v3 ?v8))))

   (:action op_2
       :parameters (?v3 - type_3 ?v4 - object ?v7 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_3 ?v4 ?v7) (pred_4 ?v3 ?v7) (pred_1 ?v3 ?v5))
       :effect (and (pred_2 ?v3 ?v4 ?v5)
		    (not (pred_3 ?v4 ?v7)) 
		    (not (pred_1 ?v3 ?v5))))

   (:action op_3
       :parameters (?v3 - type_3 ?v4 - object ?v7 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_2 ?v3 ?v4 ?v5) (pred_4 ?v3 ?v7))
       :effect (and (pred_3 ?v4 ?v7)
		    (pred_1 ?v3 ?v5)
		    (not (pred_2 ?v3 ?v4 ?v5)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_11 obj_07 - type_3
obj_03 obj_08 obj_14 obj_05 - type_2
obj_09 obj_01 obj_13 obj_06 - type_1
obj_04 obj_10 obj_12 obj_02 - object)
(:init
(pred_4 obj_11 obj_01)
(pred_1 obj_11 obj_03)
(pred_1 obj_11 obj_08)
(pred_4 obj_07 obj_06)
(pred_1 obj_07 obj_14)
(pred_1 obj_07 obj_05)
(pred_3 obj_04 obj_06)
(pred_3 obj_10 obj_13)
(pred_3 obj_12 obj_06)
(pred_3 obj_02 obj_13)
)
(:goal
(and
(pred_3 obj_04 obj_06)
(pred_3 obj_10 obj_09)
(pred_3 obj_12 obj_06)
(pred_3 obj_02 obj_01)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_11 obj_13) (pred_4 obj_07 obj_13))))
  )
)
)

; plan
1. (op_1 obj_11 obj_01 obj_09)
   deleted: (pred_4 obj_11 obj_01)
   added: (pred_4 obj_11 obj_09)
   goals met: 2 of 4
2. (op_1 obj_07 obj_06 obj_13)
   deleted: (pred_4 obj_07 obj_06)
   added: (pred_4 obj_07 obj_13)
   goals met: 2 of 4
3. (op_2 obj_07 obj_02 obj_13 obj_05)
   deleted: (pred_3 obj_02 obj_13) (pred_1 obj_07 obj_05)
   added: (pred_2 obj_07 obj_02 obj_05)
   goals met: 2 of 4
4. (op_2 obj_07 obj_10 obj_13 obj_14)
   deleted: (pred_3 obj_10 obj_13) (pred_1 obj_07 obj_14)
   added: (pred_2 obj_07 obj_10 obj_14)
   goals met: 2 of 4
5. (op_1 obj_07 obj_13 obj_01)
   deleted: (pred_4 obj_07 obj_13)
   added: (pred_4 obj_07 obj_01)
   goals met: 2 of 4
6. (op_3 obj_07 obj_02 obj_01 obj_05)
   deleted: (pred_2 obj_07 obj_02 obj_05)
   added: (pred_3 obj_02 obj_01) (pred_1 obj_07 obj_05)
   goals met: 3 of 4
7. (op_1 obj_07 obj_01 obj_09)
   deleted: (pred_4 obj_07 obj_01)
   added: (pred_4 obj_07 obj_09)
   goals met: 3 of 4
8. (op_3 obj_07 obj_10 obj_09 obj_14)
   deleted: (pred_2 obj_07 obj_10 obj_14)
   added: (pred_3 obj_10 obj_09) (pred_1 obj_07 obj_14)
   goals met: 4 of 4
